AAReddit/app/controllers/application_controller.rb

  def is_sub_owner?
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]