AAReddit/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "woohoo"], ["url", ""], ["content", "whooowhoo"], ["author_id", 3], ["created_at", "2019-02-06 01:31:28.209935"], ["updated_at", "2019-02-06 01:31:28.209935"]]