AAReddit/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Something else"], ["description", "Still a test"], ["updated_at", "2019-02-05 21:50:20.493466"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])

    if @sub.moderator_id == current_user.id && @sub.update_attributes(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def is_sub_owner?
    @sub = Sub.find(params[:id])