AAReddit/app/views/posts/new.html.erb

  <label>Subs to add your post to:<br>
   <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"